Ran Plan for project: `S3` dir: `workspaces/851725403398/ap-southeast-1` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_s3_bucket.this will be destroyed
  # (because resource uses count or for_each)
- resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::phongvupham-unique-name-161618122024" -> null
      - bucket                      = "phongvupham-unique-name-161618122024" -> null
      - bucket_domain_name          = "phongvupham-unique-name-161618122024.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "phongvupham-unique-name-161618122024.s3.ap-southeast-1.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z3O0J2DXBE1FTB" -> null
      - id                          = "phongvupham-unique-name-161618122024" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ap-southeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "dev"
          - "Project"     = "MyS3BucketProject"
        } -> null
      - tags_all                    = {
          - "Environment" = "dev"
          - "Project"     = "MyS3BucketProject"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "95eaf84498a55ed4c1efa0f84a134a2edc0f963877cef87d5aef1e83dac49e4b" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.this["main.yaml"] will be created
+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "phongvupham-unique-name-161618122024"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Project"     = "MyS3BucketProject"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Project"     = "MyS3BucketProject"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.this["s3-test-add.yaml"] will be created
+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "phongvupham-unique-S3-name-084619122024"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Project"     = "MyS3BucketProject"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Project"     = "MyS3BucketProject"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.this will be destroyed
  # (because resource uses count or for_each)
- resource "aws_s3_bucket_acl" "this" {
      - acl                   = "private" -> null
      - bucket                = "phongvupham-unique-name-161618122024" -> null
      - id                    = "phongvupham-unique-name-161618122024,private" -> null
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name  = "phongvupham1110" -> null
                  - id            = "95eaf84498a55ed4c1efa0f84a134a2edc0f963877cef87d5aef1e83dac49e4b" -> null
                  - type          = "CanonicalUser" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - owner {
              - display_name = "phongvupham1110" -> null
              - id           = "95eaf84498a55ed4c1efa0f84a134a2edc0f963877cef87d5aef1e83dac49e4b" -> null
            }
        }
    }

  # aws_s3_bucket_acl.this["main.yaml"] will be created
+ resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_acl.this["s3-test-add.yaml"] will be created
+ resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_ownership_controls.this will be destroyed
  # (because resource uses count or for_each)
- resource "aws_s3_bucket_ownership_controls" "this" {
      - bucket = "phongvupham-unique-name-161618122024" -> null
      - id     = "phongvupham-unique-name-161618122024" -> null

      - rule {
          - object_ownership = "BucketOwnerPreferred" -> null
        }
    }

  # aws_s3_bucket_ownership_controls.this["main.yaml"] will be created
+ resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_ownership_controls.this["s3-test-add.yaml"] will be created
+ resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_public_access_block.this will be destroyed
  # (because resource uses count or for_each)
- resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "phongvupham-unique-name-161618122024" -> null
      - id                      = "phongvupham-unique-name-161618122024" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.this["main.yaml"] will be created
+ resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.this["s3-test-add.yaml"] will be created
+ resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.versioning will be destroyed
  # (because resource uses count or for_each)
- resource "aws_s3_bucket_versioning" "versioning" {
      - bucket                = "phongvupham-unique-name-161618122024" -> null
      - id                    = "phongvupham-unique-name-161618122024" -> null
        # (1 unchanged attribute hidden)

      - versioning_configuration {
          - status     = "Suspended" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket_versioning.versioning["main.yaml"] will be created
+ resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Suspended"
        }
    }

  # aws_s3_bucket_versioning.versioning["s3-test-add.yaml"] will be created
+ resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Suspended"
        }
    }

Plan: 10 to add, 0 to change, 5 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p S3
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://534d39a5cd57:4141/lock?id=PhongPhamj%252Frun-atlantis-demo%252Fworkspaces%252F851725403398%252Fap-southeast-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p S3
  ```
Plan: 10 to add, 0 to change, 5 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```